BeimFish/X/startup/stm32h747xih6_m4.s
.syntax unified
.cpu cortex-m4
.fpu softvfp
.thumb

.global g_pfnVectors
.global Default_Handler

  .section .text.Reset_Handler
  .weak Reset_Handler
  .type Reset_Handler, %function
Reset_Handler:
  ldr   r0, =_estack
  mov   sp, r0
  bl main
  .size Reset_Handler, .-Reset_Handler


  .section .text.Default_Handler,"ax",%progbits
Default_Handler:
Infinite_Loop:
  b Infinite_Loop
  .size Default_Handler, .-Default_Handler


  .section .isr_vector,"a",%progbits
  .type g_pfnVectors, %object
g_pfnVectors:
  .word _estack
  .word Reset_Handler
  .word NMI_Handler
  .word HardFault_Handler
  .word	MemManage_Handler
  .word	BusFault_Handler
  .word	UsageFault_Handler
  .word	0
  .word	0
  .word	0
  .word	0
  .word	SVC_Handler
  .word	DebugMon_Handler
  .word	0
  .word	PendSV_Handler
  .word	SysTick_Handler
  .word	WWDG1_IRQHandler                 			/* Window Watchdog interrupt                   */
  .word	PVD_PVM_IRQHandler               			/* PVD through EXTI line                       */
  .word	RTC_TAMP_STAMP_CSS_LSE_IRQHandler			/* RTC tamper, timestamp                       */
  .word	RTC_WKUP_IRQHandler              			/* RTC Wakeup interrupt                        */
  .word	FLASH_IRQHandler                 			/* Flash memory                                */
  .word	RCC_IRQHandler                   			/* RCC global interrupt                        */
  .word	EXTI0_IRQHandler                 			/* EXTI Line 0 interrupt                       */
  .word	EXTI1_IRQHandler                 			/* EXTI Line 1 interrupt                       */
  .word	EXTI2_IRQHandler                 			/* EXTI Line 2 interrupt                       */
  .word	EXTI3_IRQHandler                 			/* EXTI Line 3interrupt                        */
  .word	EXTI4_IRQHandler                 			/* EXTI Line 4interrupt                        */
  .word	DMA_STR0_IRQHandler              			/* DMA1 Stream0                                */
  .word	DMA_STR1_IRQHandler              			/* DMA1 Stream1                                */
  .word	DMA_STR2_IRQHandler              			/* DMA1 Stream2                                */
  .word	DMA_STR3_IRQHandler              			/* DMA1 Stream3                                */
  .word	DMA_STR4_IRQHandler              			/* DMA1 Stream4                                */
  .word	DMA_STR5_IRQHandler              			/* DMA1 Stream5                                */
  .word	DMA_STR6_IRQHandler              			/* DMA1 Stream6                                */
  .word	ADC1_2_IRQHandler                			/* ADC1 and ADC2                               */
  .word	FDCAN1_IT0_IRQHandler            			/* FDCAN1 Interrupt 0                          */
  .word	FDCAN2_IT0_IRQHandler            			/* FDCAN2 Interrupt 0                          */
  .word	FDCAN1_IT1_IRQHandler            			/* FDCAN1 Interrupt 1                          */
  .word	FDCAN2_IT1_IRQHandler            			/* FDCAN2 Interrupt 1                          */
  .word	EXTI9_5_IRQHandler               			/* EXTI Line[9:5] interrupts                   */
  .word	TIM1_BRK_IRQHandler              			/* TIM1 break interrupt                        */
  .word	TIM1_UP_IRQHandler               			/* TIM1 update interrupt                       */
  .word	TIM1_TRG_COM_IRQHandler          			/* TIM1 trigger and commutation                */
  .word	TIM_CC_IRQHandler                			/* TIM1 capture / compare                      */
  .word	TIM2_IRQHandler                  			/* TIM2 global interrupt                       */
  .word	TIM3_IRQHandler                  			/* TIM3 global interrupt                       */
  .word	TIM4_IRQHandler                  			/* TIM4 global interrupt                       */
  .word	I2C1_EV_IRQHandler               			/* I2C1 event interrupt                        */
  .word	I2C1_ER_IRQHandler               			/* I2C1 error interrupt                        */
  .word	I2C2_EV_IRQHandler               			/* I2C2 event interrupt                        */
  .word	I2C2_ER_IRQHandler               			/* I2C2 error interrupt                        */
  .word	SPI1_IRQHandler                  			/* SPI1 global interrupt                       */
  .word	SPI2_IRQHandler                  			/* SPI2 global interrupt                       */
  .word	USART1_IRQHandler                			/* USART1 global interrupt                     */
  .word	USART2_IRQHandler                			/* USART2 global interrupt                     */
  .word	USART3_IRQHandler                			/* USART3 global interrupt                     */
  .word	EXTI15_10_IRQHandler             			/* EXTI Line[15:10] interrupts                 */
  .word	RTC_ALARM_IRQHandler             			/* RTC alarms (A and B)                        */
  .word	0                                			/* Reserved                                    */
  .word	TIM8_BRK_TIM12_IRQHandler        			/* TIM8 and 12 break global                    */
  .word	TIM8_UP_TIM13_IRQHandler         			/* TIM8 and 13 update global                   */
  .word	TIM8_TRG_COM_TIM14_IRQHandler    			/* TIM8 and 14 trigger /commutation and global */
  .word	TIM8_CC_IRQHandler               			/* TIM8 capture / compare                      */
  .word	DMA1_STR7_IRQHandler             			/* DMA1 Stream7                                */
  .word	FMC_IRQHandler                   			/* FMC global interrupt                        */
  .word	SDMMC1_IRQHandler                			/* SDMMC global interrupt                      */
  .word	TIM5_IRQHandler                  			/* TIM5 global interrupt                       */
  .word	SPI3_IRQHandler                  			/* SPI3 global interrupt                       */
  .word	UART4_IRQHandler                 			/* UART4 global interrupt                      */
  .word	UART5_IRQHandler                 			/* UART5 global interrupt                      */
  .word	TIM6_DAC_IRQHandler              			/* TIM6 global interrupt                       */
  .word	TIM7_IRQHandler                  			/* TIM7 global interrupt                       */
  .word	DMA2_STR0_IRQHandler             			/* DMA2 Stream0 interrupt                      */
  .word	DMA2_STR1_IRQHandler             			/* DMA2 Stream1 interrupt                      */
  .word	DMA2_STR2_IRQHandler             			/* DMA2 Stream2 interrupt                      */
  .word	DMA2_STR3_IRQHandler             			/* DMA2 Stream3 interrupt                      */
  .word	DMA2_STR4_IRQHandler             			/* DMA2 Stream4 interrupt                      */
  .word	ETH_IRQHandler                   			/* Ethernet global interrupt                   */
  .word	ETH_WKUP_IRQHandler              			/* Ethernet wakeup through EXTI                */
  .word	FDCAN_CAL_IRQHandler             			/* CAN2TX interrupts                           */
  .word	0                                			/* Reserved                                    */
  .word	cm4_sev_it_IRQHandler            			/* Arm Cortex-M4 Send even interrupt           */
  .word	0                                			/* Reserved                                    */
  .word	0                                			/* Reserved                                    */
  .word	DMA2_STR5_IRQHandler             			/* DMA2 Stream5 interrupt                      */
  .word	DMA2_STR6_IRQHandler             			/* DMA2 Stream6 interrupt                      */
  .word	DMA2_STR7_IRQHandler             			/* DMA2 Stream7 interrupt                      */
  .word	USART6_IRQHandler                			/* USART6 global interrupt                     */
  .word	I2C3_EV_IRQHandler               			/* I2C3 event interrupt                        */
  .word	I2C3_ER_IRQHandler               			/* I2C3 error interrupt                        */
  .word	OTG_HS_EP1_OUT_IRQHandler        			/* OTG_HS out global interrupt                 */
  .word	OTG_HS_EP1_IN_IRQHandler         			/* OTG_HS in global interrupt                  */
  .word	OTG_HS_WKUP_IRQHandler           			/* OTG_HS wakeup interrupt                     */
  .word	OTG_HS_IRQHandler                			/* OTG_HS global interrupt                     */
  .word	DCMI_IRQHandler                  			/* DCMI global interrupt                       */
  .word	0                                			/* Reserved                                    */
  .word	HASH_RNG_IRQHandler              			/* HASH and RNG global interrupt               */
  .word	FPU_IRQHandler                   			/* CPU1                                        */
  .word	UART7_IRQHandler                 			/* UART7 global interrupt                      */
  .word	UART8_IRQHandler                 			/* UART8 global interrupt                      */
  .word	SPI4_IRQHandler                  			/* SPI4 global interrupt                       */
  .word	SPI5_IRQHandler                  			/* SPI5 global interrupt                       */
  .word	SPI6_IRQHandler                  			/* SPI6 global interrupt                       */
  .word	SAI1_IRQHandler                  			/* SAI1 global interrupt                       */
  .word	LTDC_IRQHandler                  			/* LCD-TFT global interrupt                    */
  .word	LTDC_ER_IRQHandler               			/* LCD-TFT error interrupt                     */
  .word	DMA2D_IRQHandler                 			/* DMA2D global interrupt                      */
  .word	SAI2_IRQHandler                  			/* SAI2 global interrupt                       */
  .word	QUADSPI_IRQHandler               			/* QuadSPI global interrupt                    */
  .word	LPTIM1_IRQHandler                			/* LPTIM1 global interrupt                     */
  .word	CEC_IRQHandler                   			/* HDMI-CEC global interrupt                   */
  .word	I2C4_EV_IRQHandler               			/* I2C4 event interrupt                        */
  .word	I2C4_ER_IRQHandler               			/* I2C4 error interrupt                        */
  .word	SPDIF_IRQHandler                 			/* SPDIFRX global interrupt                    */
  .word	OTG_FS_EP1_OUT_IRQHandler        			/* OTG_FS out global interrupt                 */
  .word	OTG_FS_EP1_IN_IRQHandler         			/* OTG_FS in global interrupt                  */
  .word	OTG_FS_WKUP_IRQHandler           			/* OTG_FS wakeup                               */
  .word	OTG_FS_IRQHandler                			/* OTG_FS global interrupt                     */
  .word	DMAMUX1_OV_IRQHandler            			/* DMAMUX1 overrun interrupt                   */
  .word	HRTIM1_MST_IRQHandler            			/* HRTIM1 master timer interrupt               */
  .word	HRTIM1_TIMA_IRQHandler           			/* HRTIM1 timer A interrupt                    */
  .word	HRTIM_TIMB_IRQHandler            			/* HRTIM1 timer B interrupt                    */
  .word	HRTIM1_TIMC_IRQHandler           			/* HRTIM1 timer C interrupt                    */
  .word	HRTIM1_TIMD_IRQHandler           			/* HRTIM1 timer D interrupt                    */
  .word	HRTIM_TIME_IRQHandler            			/* HRTIM1 timer E interrupt                    */
  .word	HRTIM1_FLT_IRQHandler            			/* HRTIM1 fault interrupt                      */
  .word	DFSDM1_FLT0_IRQHandler           			/* DFSDM1 filter 0 interrupt                   */
  .word	DFSDM1_FLT1_IRQHandler           			/* DFSDM1 filter 1 interrupt                   */
  .word	DFSDM1_FLT2_IRQHandler           			/* DFSDM1 filter 2 interrupt                   */
  .word	DFSDM1_FLT3_IRQHandler           			/* DFSDM1 filter 3 interrupt                   */
  .word	SAI3_IRQHandler                  			/* SAI3 global interrupt                       */
  .word	SWPMI1_IRQHandler                			/* SWPMI global interrupt                      */
  .word	TIM15_IRQHandler                 			/* TIM15 global interrupt                      */
  .word	TIM16_IRQHandler                 			/* TIM16 global interrupt                      */
  .word	TIM17_IRQHandler                 			/* TIM17 global interrupt                      */
  .word	MDIOS_WKUP_IRQHandler            			/* MDIOS wakeup                                */
  .word	MDIOS_IRQHandler                 			/* MDIOS global interrupt                      */
  .word	JPEG_IRQHandler                  			/* JPEG global interrupt                       */
  .word	MDMA_IRQHandler                  			/* MDMA                                        */
  .word	0                                			/* Reserved                                    */
  .word	SDMMC_IRQHandler                 			/* SDMMC global interrupt                      */
  .word	HSEM0_IRQHandler                 			/* HSEM global interrupt 1                     */
  .word	0                                			/* Reserved                                    */
  .word	ADC3_IRQHandler                  			/* ADC3 global interrupt                       */
  .word	DMAMUX2_OVR_IRQHandler           			/* DMAMUX2 overrun interrupt                   */
  .word	BDMA_CH1_IRQHandler              			/* BDMA channel 1 interrupt                    */
  .word	BDMA_CH2_IRQHandler              			/* BDMA channel 2 interrupt                    */
  .word	BDMA_CH3_IRQHandler              			/* BDMA channel 3 interrupt                    */
  .word	BDMA_CH4_IRQHandler              			/* BDMA channel 4 interrupt                    */
  .word	BDMA_CH5_IRQHandler              			/* BDMA channel 5 interrupt                    */
  .word	BDMA_CH6_IRQHandler              			/* BDMA channel 6 interrupt                    */
  .word	BDMA_CH7_IRQHandler              			/* BDMA channel 7 interrupt                    */
  .word	BDMA_CH8_IRQHandler              			/* BDMA channel 8 interrupt                    */
  .word	COMP_IRQHandler                  			/* COMP1 and COMP2                             */
  .word	LPTIM2_IRQHandler                			/* LPTIM2 timer interrupt                      */
  .word	LPTIM3_IRQHandler                			/* LPTIM2 timer interrupt                      */
  .word	LPTIM4_IRQHandler                			/* LPTIM2 timer interrupt                      */
  .word	LPTIM5_IRQHandler                			/* LPTIM2 timer interrupt                      */
  .word	LPUART_IRQHandler                			/* LPUART global interrupt                     */
  .word	WWDG2_RST_IRQHandler             			/* Window Watchdog interrupt                   */
  .word	CRS_IRQHandler                   			/* Clock Recovery System globa                 */
  .word	0                                			/* Reserved                                    */
  .word	SAI4_IRQHandler                  			/* SAI4 global interrupt                       */
  .word	0                                			/* Reserved                                    */
  .word	HOLD_CORE_IRQHandler             			/* CPU1 hold                                   */
  .word	WKUP_IRQHandler                  			/* WKUP1 to WKUP6 pins                         */
  .size g_pfnVectors, .-g_pfnVectors

	.weak	NMI_Handler
	.thumb_set NMI_Handler,Default_Handler

	.weak	HardFault_Handler
	.thumb_set HardFault_Handler,Default_Handler

	.weak	MemManage_Handler
	.thumb_set MemManage_Handler,Default_Handler

	.weak	BusFault_Handler
	.thumb_set BusFault_Handler,Default_Handler

